In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("titanic.csv")

In [3]:
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [6]:
inputs = df.drop('Survived',axis='columns')

In [8]:
target = df['Survived']

In [9]:
from sklearn.preprocessing import LabelEncoder

In [10]:
sex = LabelEncoder()

In [13]:
inputs['sex_new'] = sex.fit_transform(inputs['Sex'])

In [14]:
inputs

     Pclass     Sex   Age     Fare  sex_new
0         3    male  22.0   7.2500        1
1         1  female  38.0  71.2833        0
2         3  female  26.0   7.9250        0
3         1  female  35.0  53.1000        0
4         3    male  35.0   8.0500        1
..      ...     ...   ...      ...      ...
886       2    male  27.0  13.0000        1
887       1  female  19.0  30.0000        0
888       3  female   NaN  23.4500        0
889       1    male  26.0  30.0000        1
890       3    male  32.0   7.7500        1

[891 rows x 5 columns]

In [15]:
inputs_new = inputs.drop(['Sex'],axis='columns')

In [17]:
inputs_new

     Pclass   Age     Fare  sex_new
0         3  22.0   7.2500        1
1         1  38.0  71.2833        0
2         3  26.0   7.9250        0
3         1  35.0  53.1000        0
4         3  35.0   8.0500        1
..      ...   ...      ...      ...
886       2  27.0  13.0000        1
887       1  19.0  30.0000        0
888       3   NaN  23.4500        0
889       1  26.0  30.0000        1
890       3  32.0   7.7500        1

[891 rows x 4 columns]

In [18]:
target

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [22]:
df.isnull()

     Survived  Pclass    Sex    Age   Fare
0       False   False  False  False  False
1       False   False  False  False  False
2       False   False  False  False  False
3       False   False  False  False  False
4       False   False  False  False  False
..        ...     ...    ...    ...    ...
886     False   False  False  False  False
887     False   False  False  False  False
888     False   False  False   True  False
889     False   False  False  False  False
890     False   False  False  False  False

[891 rows x 5 columns]

In [23]:
df.isnull().values.any()

True

In [24]:
df.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
Fare          0
dtype: int64

In [25]:
inputs_new.Age = inputs_new.Age.fillna(inputs_new.Age.mean())

In [26]:
inputs_new.head()

   Pclass   Age     Fare  sex_new
0       3  22.0   7.2500        1
1       1  38.0  71.2833        0
2       3  26.0   7.9250        0
3       1  35.0  53.1000        0
4       3  35.0   8.0500        1

In [28]:
inputs_new.head()

   Pclass   Age     Fare  sex_new
0       3  22.0   7.2500        1
1       1  38.0  71.2833        0
2       3  26.0   7.9250        0
3       1  35.0  53.1000        0
4       3  35.0   8.0500        1

In [29]:
inputs_new.isnull().sum()

Pclass     0
Age        0
Fare       0
sex_new    0
dtype: int64

In [30]:
from sklearn.model_selection import train_test_split

In [50]:
X_train, X_test, y_train, y_test = train_test_split(inputs_new,target,test_size=0.2,random_state=1)

In [51]:
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [52]:
model.fit(X_train, y_train)

DecisionTreeClassifier()

In [53]:
model.score(X_test, y_test)

0.7541899441340782

In [54]:
y_pred = model.predict(X_test)

In [55]:
y_pred

array([1, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0,
       1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0,
       1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0,
       0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0,
       1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0,
       1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0,
       0, 0, 1], dtype=int64)

In [56]:
print(y_test)

862    1
223    0
84     1
680    0
535    1
      ..
796    1
815    0
629    0
421    0
448    1
Name: Survived, Length: 179, dtype: int64